<a href="https://colab.research.google.com/github/adudars/PedidON/blob/master/arquivos/9.5_InstrucoesAtualizacao%26ExclusaoDados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.5 INSTRUÇÕES APLICANDO ATUALIZAÇÃO E EXCLUSÃO DE DADOS

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [1]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [3]:
import pandas as pd
import psycopg2

### Conectando com o banco através do psycopg2

In [35]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com", database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## ATUALIZAÇÃO

### Funcionário

In [9]:
cursor_updt_funcionario = conn.cursor()
cursor_updt_funcionario.execute("""update funcionario
                                    set nome_funcionario = 'Matheus Henrique', matricula_funcionario = 5200302
                                    where id_funcionario = 2;""")
conn.commit()

In [10]:
updt_funcionario = pd.read_sql("""select *
                                  from funcionario
                                  where id_funcionario = 2
                                  """,conn)

In [11]:
updt_funcionario

   id_funcionario  nome_funcionario  matricula_funcionario
0               2  Matheus Henrique                5200302

### Categoria

In [22]:
cursor_updt_categoria = conn.cursor()
cursor_updt_categoria.execute("""update tamanho
                                set descricao_tamanho = 'individual'
                                where descricao_tamanho = '1 pessoa';""")

conn.commit()

In [24]:
updt_categoria = pd.read_sql_query("""select *
                                      from tamanho
                                      where descricao_tamanho = 'individual'""", conn)

In [25]:
updt_categoria

   id_tamanho descricao_tamanho
0           2        individual

### Preço item

In [26]:
cursor_updt_item = conn.cursor()
cursor_updt_item.execute("""update item_cardapio
                                  set preco = preco * 1.1
                                  where preco = (select min(preco) from item_Cardapio);""")
conn.commit()

In [28]:
updt_item = pd.read_sql_query("""select *
                                from item_cardapio
                                where preco = (select min(preco) from item_Cardapio)""", conn)

In [29]:
updt_item

   id_itemcardapio nome_item  ...  fk_id_categoria fk_id_tamanho
0               41      Água  ...               20            12

[1 rows x 6 columns]

## EXCLUSÃO

### Tamanho

In [30]:
cursor_dlt_tamanho = conn.cursor()
cursor_dlt_tamanho.execute("""delete from tamanho
                            where descricao_tamanho = 'infantil'""")
conn.commit()

In [31]:
dlt_tamanho = pd.read_sql_query("""select * from tamanho""", conn)

In [32]:
dlt_tamanho

    id_tamanho descricao_tamanho
0            1         2 pessoas
1            4         long neck
2            5              lata
3            3         3 pessoas
4            6         4 pessoas
5            7         5 pessoas
6            8             jarra
7            9              copo
8           10              taça
9           11           garrafa
10          12             330ml
11          13             500ml
12          14             600ml
13          15                1l
14          16                2l
15          17                3l
16          18              dose
17          19             combo
18          20           unidade
19           2        individual

### Observação

In [36]:
cursor_dlt_obs = conn.cursor()
cursor_dlt_obs.execute("""delete from observacao
                            where descricao_obs = '2 porções extras de arroz';""")
conn.commit()

In [37]:
dlt_obs = pd.read_sql_query("""select * from observacao""", conn)

In [38]:
dlt_obs

    id_obs                                      descricao_obs  fk_id_pedido
0        1                                            Sem sal             1
1        2                            Um prato e talher extra             4
2        3                                          Sem nozes             5
3        4                                         Sem espuma             7
4        5                        Dois copos com gelo e limão             9
5        6                                Sem os pães da casa            12
6        7                                       Sem maracujá            10
7        8                                     Servir no copo             8
8       10                                  Adicionar pimenta            11
9        9                              Porção extra de arroz            14
10      11                                     Só filé mignon            27
11      12                                      Copo com gelo            30
12      13                                  Azeitonas no copo            35
13      14                                   Legumes no ponto            40
14      15                                           Limonada            41
15      16                               Abrir na minha frete            50
16      17                                 Água de coco junto            54
17      18                                       Coloca limão            55
18      19  Ostras de Vitória mesmo. De Santa Catarina vai...            66
19      20                                    2 águas de coco            72

### Pedido

In [39]:
cursor_dlt_pedido = conn.cursor()
cursor_dlt_pedido.execute("""delete from pedido
                                    where id_pedido = 73;""")

In [40]:
dlt_pedido = pd.read_sql_query("""select * from pedido""", conn)

In [41]:
dlt_pedido

    id_pedido  quantidade      hora  fk_id_comanda  fk_id_itemcardapio
0           1           2  12:58:00              1                   1
1           2           1  13:19:00              1                   2
2           3           1  12:34:00              2                   3
3           4           3  12:45:00              3                   4
4           5           1  12:45:00              3                   5
..        ...         ...       ...            ...                 ...
67         68           1  12:43:00             66                  13
68         69           2  13:09:00             67                  14
69         70           3  13:38:00             68                  15
70         71           4  13:51:00             69                  16
71         72           2  14:00:00             70                  17

[72 rows x 5 columns]